# Width Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..Width Property
TextNode Class See Also
---
Width [ft] of the area of the text content in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Width { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Width As Double
	Get
```

Visual C++
---
```text
public:
property double Width {
	double get ();
}
```

# Remarks
Specifies the actual width of the text, that is essentially the width of the longest line, including any spaces. The value represents the width after the width scale has been applied.
# See Also
TextNode Class
Autodesk.Revit.DB Namespace